<?php
$str = "艺，芸，芷，艾，若，茉，茵，茜，荔，薇，朵，柠，檬，伊，佳，锦，禾，宜，画";
$str1 = "维、启、克、伦、翔、旭、鹏、泽、晨、辰、士、以、渝、菁、弘、佩、勋、宁、元、建、家、致、树、炎、德、行、时、泰、盛、雄、琛、钧、冠、策、腾、楠、榕、风、航、弘、瑛、玲、憧、萍、雪、珍、滢、筠、柔、竹、霭、凝、晓、欢、霄、枫、芸、菲、寒、伊、亚、宜、可、姬、舒、影、荔、枝、丽、秀、娟、英、华、慧、巧、美、静、淑、惠、珠、莹、雪、琳、晗、瑶、佳、涵、晋、逸、沅、海、乐、嘉、哲、俊、勤、珍、贞、莉、兰、凤、洁、琳、素、云、莲、真、环、雪、荣、爱、妹、霞、栋、香、月、媛、艳、瑞、凡、佳、嘉、叶、璧、璐、娅、琦、晶、妍、博、维、泰、诗、茜、秋、珊、莎、锦、黛、青、倩、婷、姣、婉、娴、瑾、颖、露、瑶、怡、婵、雁、蓓、纨、仪、荷、丹、蓉、眉、君、琴、蕊、薇、菁、梦、岚、苑、婕、馨、瑗、琰、韵、融、园、艺、咏、卿、聪、澜、纯、毓、悦、昭、冰、爽、琬、茗、羽、希、宁、欣、飘、育、涵、琴、晴、丽、美、瑶、梦、茜、倩、希、夕、月、悦、乐、彤、影、珍、依、沫、玉、灵、瑶、嫣、倩、妍、萱、漩、娅、媛、怡、佩、淇、雨、娜、莹、娟、文、芳、莉、雅、芝、文、晨、宇、怡、全、子、凡、悦、思、奕、泉、坤、恒、钊、钧、铎、铭、皑、柏、镇、淇、淳、一、洁、茹、清、吉、克、先、依、浩、泓、亮、允、元、源、渊、和、函、妤、宜、云、琪、菱、宣、沂、健、信、媛、凯、伊、欣、可、洋、萍、荣、榕、含、佑、明、雄、芝、英、义、卿、乾、亦、雅、芝、烨、萱、昊、芸、天、岚、昕、尧、鸿、棋、琳、宸、乔、丞、安、毅、凌、惠、珠";
$arr = explode("，",$str);
$arr1 = explode("、",$str1);
echo "<head><meta name='viewport' content='width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no'>";
echo "<style> *{font-size:22px;}</style>";
echo "<input type='button' onclick='javascript:window.location.reload();' value='刷新'><br/>";
for($i=0;$i<10;++$i){
    $key1 = array_rand($arr);
    $key2 = array_rand($arr1);
    echo '郑'.$arr[$key1].$arr1[$key2].'   ';
    echo '郑'.$arr1[$key2].$arr[$key1]."<br/><br/>";
}





echo "</head>";
die;
